{
  "articles": [
    {
      "id": 1,
      "author": "Clara Monteiro",
      "title": "Descobertas recentes em energia renovável na Universidade Federal do Brasil",
      "description": "Pesquisadores da Universidade Federal do Brasil anunciaram uma nova tecnologia que promete revolucionar o campo das energias renováveis, aumentando a eficiência dos painéis solares em 40%.",
      "url": "https://example.com/post/2024/04/27/descobertas-energia-renovavel",
      "urlToImage": "https://images.unsplash.com/photo-1558979847-53a443fab1c9?q=80&w=2641&auto=format&fit=crop&ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8fA%3D%3D",
      "publishedAt": "2024-04-27T12:00:00Z",
      "content": "Um grupo de pesquisadores da Universidade Federal do Brasil fez uma grande descoberta que pode mudar a maneira como utilizamos energia solar. Eles desenvolveram uma nova camada fotovoltaica que, quando aplicada aos painéis solares tradicionais, aumenta sua eficiência em quase 40%. Os detalhes do estudo foram publicados na última edição do Journal of Renewable Energies e estão despertando grande interesse em todo o mundo."
    },
    {
      "id": 2,
      "author": "Marco Túlio Santos",
      "title": "Lançamento do primeiro carro autônomo produzido no Brasil",
      "description": "A Autotech, uma startup brasileira, revelou hoje seu primeiro modelo de carro totalmente autônomo, prometendo transformar o transporte urbano no país.",
      "url": "https://example.com/post/2024/05/07/carro-autonomo-brasil",
      "urlToImage": "https://images.unsplash.com/photo-1576289681078-d32a1bdcf9b5?q=80&w=3270&auto=format&fit=crop&ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8fA%3D%3D",
      "publishedAt": "2024-05-07T11:19:00Z",
      "content": "Hoje, em um evento realizado em São Paulo, a startup brasileira Autotech revelou seu primeiro modelo de carro totalmente autônomo. Este veículo, chamado 'Futuro', promete revolucionar o transporte urbano, oferecendo uma solução segura, eficiente e ambientalmente amigável. A Autotech afirmou que o carro possui uma tecnologia de sensoriamento avançada e uma interface inteligente que garantem uma experiência de condução sem precedentes."
    },
    {
      "id": 3,
      "author": "Lúcia Ferreira",
      "title": "Novas pesquisas indicam avanços na cura do Alzheimer",
      "description": "Cientistas do Instituto de Neurociências do Brasil anunciam um novo tratamento que pode retardar significativamente a progressão do Alzheimer.",
      "url": "https://example.com/post/2024/05/11/cura-alzheimer",
      "urlToImage": "https://images.unsplash.com/photo-1557495876-aa846fcac3c4?q=80&w=3270&auto=format&fit=crop&ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8fA%3D%3D",
      "publishedAt": "2024-05-11T12:00:00Z",
      "content": "Em um desenvolvimento emocionante na luta contra o Alzheimer, pesquisadores do Instituto de Neurociências do Brasil apresentaram um novo tratamento que mostra a capacidade de retardar a progressão da doença. Os resultados preliminares dos testes clínicos são promissores e representam um marco importante na busca por uma cura efetiva para o Alzheimer."
    },
    {
      "id": 4,
      "author": "Renata Gomes",
      "title": "Tecnologia 5G chega a mais cidades brasileiras",
      "description": "O avanço da tecnologia 5G continua a se expandir no Brasil, com novas cidades recebendo cobertura total até o final do ano.",
      "url": "https://example.com/post/2024/05/13/expansao-5g-brasil",
      "urlToImage": "https://images.unsplash.com/photo-1603513722284-1125b0b0a4bb?q=80&w=3270&auto=format&fit=crop&ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8fA%3D%3D",
      "publishedAt": "2024-05-13T16:34:00Z",
      "content": "A tecnologia 5G está se expandindo rapidamente no Brasil, com várias novas cidades programadas para receber cobertura total até o final deste ano. Este avanço promete transformar diversas áreas, desde telecomunicações até desenvolvimento urbano, trazendo velocidades de internet significativamente mais rápidas e mais confiabilidade na conexão."
    },
    {
      "id": 5,
      "author": "Paulo Andrade",
      "title": "Crescimento do mercado de realidade virtual no Brasil",
      "description": "O mercado de realidade virtual está crescendo exponencialmente no Brasil, com mais consumidores adotando a tecnologia para educação, entretenimento e trabalho remoto.",
      "url": "https://example.com/post/2024/05/09/realidade-virtual-brasil",
      "urlToImage": "https://images.unsplash.com/photo-1605647540924-852290f6b0d5?q=80&w=3237&auto=format&fit=crop&ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8fA%3D%3D",
      "publishedAt": "2024-05-09T17:47:00Z",
      "content": "O interesse pela realidade virtual no Brasil tem visto um crescimento exponencial, com um número cada vez maior de consumidores adotando esta tecnologia. Seja para fins educacionais, entretenimento ou até mesmo trabalho remoto, a realidade virtual está provando ser uma ferramenta valiosa e versátil, segundo um relatório recente publicado pelo Instituto Brasileiro de Tecnologia Avançada."
    }
  ]
}
